Task: Expedition 
Program to test: pivoivislab2 
................  
Test 1 
0Сравнение файлов 1.OUT и OUTPUT.TXT
FC: различия не найдены

Test 2 
0Сравнение файлов 2.OUT и OUTPUT.TXT
FC: различия не найдены

Test 3 
0Сравнение файлов 3.OUT и OUTPUT.TXT
FC: различия не найдены

Test 4 
0Сравнение файлов 4.OUT и OUTPUT.TXT
FC: различия не найдены

Test 5 
0Сравнение файлов 5.OUT и OUTPUT.TXT
FC: различия не найдены

Test 6 
0Сравнение файлов 6.OUT и OUTPUT.TXT
FC: различия не найдены

Test 7 
Time Limit
Сравнение файлов 7.OUT и OUTPUT.TXT
Не удается выполнить синхронизацию строк. Слишком много различий между файлами.
***** 7.OUT
88 64 47 88 63 47
...
78 17 5 78 17 4
***** OUTPUT.TXT
*****

Test 8 
Time Limit
Сравнение файлов 8.OUT и OUTPUT.TXT
Не удается выполнить синхронизацию строк. Слишком много различий между файлами.
***** 8.OUT
2 49 14 2 48 14
...
55 77 73 55 78 73
***** OUTPUT.TXT
*****

Test 9 
0Сравнение файлов 9.OUT и OUTPUT.TXT
FC: различия не найдены

Test 10 
-1Сравнение файлов 10.OUT и OUTPUT.TXT
FC: различия не найдены

